//--------------------------------------------------
// Эмулятор напряжения.
// Технически просто очень точный управляемый
// источник напряжения
//--------------------------------------------------
#ifndef EMU_U_H
#define EMU_U_H

//--------------------------------------------------
#include <stdint.h>

//--------------------------------------------------
#ifdef __cplusplus
extern "C" {
#endif

void emuu_init(void);
uint8_t emuu_set(const uint32_t val);

#ifdef __cplusplus
}
#endif

//--------------------------------------------------
#endif
